source/_static/diagrams/39-two-constraints.d2
direction: right
n0: "valid_systems"
n1: "valid_prog_environs"
n2: "sanity"
n0 -> n1
n1 -> n2
